package com.company;

import java.util.Scanner;

/*
 * Artiukh Mihail, #2
 */
public class Main {
    /*
     *В массиве хранится информация о баллах, полученных
     * спортсменом-десятиборцем в каждом из десяти видов спорта.
     * Для выхода в следующий этап соревнований общая сумма баллов
     * должна превысить некоторое известное значение. Определить,
     * вышел ли данный спортсмен в следующий этап соревнований.
     * .*/


    private static void task24() {

    }

    /*
     Задана последовательность N вещественных чисел.
      Вычислить значение выражения .

     */
    private static void task49() {

    }

    /*
     Дана последовательность вещественных чисел а1, a2, ..., а15.
     Определить, есть ли в последовательности отрицательные числа.
     В случае положительного ответа определить порядковый номер первого из них.
     */
    private static void task74() {

    }

    /*
    Удалить элемент массива целых чисел больший куба
     первого элемента этого массива. Если таких элементов нет,
     выдать сообщение «удаление не произведено», иначе удалить
     последний элемент из найденных.

     */
    private static void task99() {

    }

    /*
    Последовательность а1, а2, ..., an состоит из нулей и единиц.
    Поставить в начало этой последовательности нули, а затем единицы.

     */
    private static void task124() {



    }

    public static void main(String[] args) {
        task24();
        task49();
        task74();
        task99();
        task124();
    }
}
